Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/health_and_safety/ban_on_smoking_in_the_workplace_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Ban on smoking in the workplace
ga: Cosc ar chaitheamh tobac sa láthair oibre

source: Under the Public Health (Tobacco) Acts 2002-2015, smoking is forbidden in enclosed places of work
ga: Faoi na hAchtanna Sláinte Poiblí (Tobac) 2002–2015, tá cosc i bhfeidhm ar chaitheamh tobac i láithreacha oibre iniata

source: This includes office blocks, various buildings, public houses/bars, restaurants and company vehicles (cars and vans)
ga: San áireamh tá bloic oifigí, foirgnimh éagsúla, tithe tábhairne/beáir, bialanna agus feithiclí comhlachta (carranna agus veaineanna)

source: There is also a limit on the sale of cigarettes
ga: Tá teorainn le díol toitíní freisin

source: It is no longer possible to buy a pack of 10 cigarettes
ga: Ní féidir paca 10 toitíní a cheannach

source: You may only buy packs of 20 cigarettes
ga: Níl ach amháin pacaí 20 toitíní ar díol

source: The purpose of this ban is to offer protection to employees and the public who are exposed to the harmful and toxic effects of tobacco smoke in the workplace
ga: Is í an aidhm atá leis an gcosc ná cosaint a chur ar fáil d’fhostaithe agus don phobal a bheadh i mbaol thorthaí díobháileacha agus tocsaineacha ghal tobac sa láthair oibre

source: Smoking has been identified as a major cause of heart disease and a significant contributor to lung cancer
ga: Tá caitheamh tobac aitheanta mar chúis mhóir ghalar croí agus mar rannpháirtí suntasach in ailse scámhóige

source: You are not allowed to smoke in an enclosed place of work
ga: Níl cead ag éinne tobac a chaitheamh i láthair oibre iniata

source: While the ban means that smoking is forbidden in many places, there are a few exceptions:
ga: Cé go gciallaíonn an cosc nach féidir tobac a chaitheamh i neart áiteanna, tá cúpla eisceacht ann:

source: • Police station detention areas
ga: • Áiteanna coinneála i stáisiúin Gharda

source: • Hotel, guesthouse and B and B bedrooms
ga: • Seomraí codlata in óstáin, i dtithe lóistín agus i dtithe L& B

source: • Third-level educational residential facilities
ga: • Áiteanna cónaithe in institiúidí oideachais triú leibhéil

source: Even though certain places are exempt from the ban, all employers (even those who are exempt) still have the right to enforce the legislation
ga: Tá an ceart fós ag fostóirí uilig (fiú iad a bhfuil díolúine acu) an reachtaíocht a chur i bhfeidhm, cé go bhfuil díolúine ag áiteanna áirithe ón gcosc

source: In other words, even though the above organisations and institutions are not obliged to enforce the ban, they are free to do so if they wish
ga: I bhfocail eile, cé nach bhfuil iachall ar na heagraíochtaí agus na hinstitiúidí thuas an cosc a chur i bhfeidhm, is féidir leo é a dhéanamh más mian leo

source: Every employer is obliged to protect the health of staff, customers, residents and visitors to their premises
ga: Tá sé de dhualgas ag chuile fostóir sláinte na foirne, na gcustaiméirí, na n-áitritheoirí agus na gcuairteoirí dá (h)áitreabh a chosaint

source: In the case of exempted buildings only, this means that employers can, if they wish, designate certain areas of their premises as smoking or non-smoking in order to minimise risk
ga: I gcás foirgnimh diolúine amháin, ciallaíonn sé seo go bhfuil an cead ag fostóirí áiteanna ar leith dá n-áitribh a ainmniú mar áit thobac nó áit ina bhfuil cosc ar thobac chun an chontúirt a laghdú

source: This means, for example, that even though a nursing home is exempt from the smoking ban, the owners of the nursing home could order that residents may only smoke outside or in a designated smoking room
ga: Ciallaíonn sé seo, mar shampla, go bhféadfadh úinéirí teach altranais ordú a chur i bhfeidhm ionas nach bhféadfadh áitritheoirí tobac a chaitheamh ach amháin taobh amuigh den bhfoirgneamh nó i seomra tobac ainmnithe, cé go bhfuil diolúine ón gcosc ag an teach altranais

source: Given that prisons and places of detention are unique, the law does not apply to these institutions
ga: Ós rud é gur áiteanna sainiúla iad príosúin agus áiteanna coinneála, ní bhaineann an dlí leis na hinstitiúidí seo

source: Again, however, there is nothing to stop prison authorities from designating these institutions as entirely non-smoking or establish designated smoking rooms if they wish
ga: Arís, afách, is féidir le bainistíocht an phríosúin an institiúid a ainmniú mar áit ina bhfuil cosc iomlán ar thobac nó seomraí tobac a ainmniú más mian leí

source: While smoking in an enclosed workplace is forbidden, employers have discretion to provide an outdoor smoking area, subject to the requirements of the law
ga: Cé go bhfuil cosc ar thobac i láthair oibre iniata, tá cead ag fostóirí limistéar tobac taobh amuigh a chur ar fáil, ach riachtanais an dlí a chomhlíonadh

source: The law has defined an outdoor area as:
ga: Is é an sainmhíniú dlíthiúil atá ar limistéar taobh amuigh ná:

source: • A place or premises, or part of a place or premises, that is wholly uncovered by any roof, fixed or mobile
ga: • Áit, nó áitreabh, nó cuid d'áit nó d'áitreabh, nach bhfuil clúdaithe ar chor ar bith le díon, bíodh sin seasta nó soghluaiste

source: • An outdoor place or premises that is covered by a roof, so long as not more than 50% of the perimeter (outside) is covered by a wall, windows, gate or similar
ga: • Áit taobh amuigh nó áitreabh atá clúdaithe le díon, chomh fada agus nach bhfuil níos mó ná 50% den imeall (taobh amuigh) clúdaithe le balla, fuinneoga, geata nó a leithéid

source: The smoking ban also applies to common areas within buildings
ga: Baineann an cosc ar thobac le limistéir choitianta laistigh d'fhoirgnimh chomh maith

source: This means, for example, that corridors, lobby areas and reception areas of buildings such as apartment blocks and hotels are also covered
ga: Ciallaíonn sé seo, mar shampla, go gclúdaíonn sé conairí, forsheomraí agus limistéir fháilte i bhfoirgnimh cosúil le bloic árasán agus óstáin chomh maith

source: If you wish to make a complaint about smoking in a common area of an apartment block, you should first contact the management company or residents' association of the apartment block and try to reach an agreeable solution
ga: Má tá tú ag iarraidh gearán a dhéanamh faoi chaitheamh tobac i limistéar coitianta i mbloc árasán, ba cheart duit dul i dteagmháil sa chéad áit leis an gcomhlacht bainistíochta/cumann áitritheoirí chun iarracht a dhéanamh teacht ar réiteach

source: If you wish to make a complaint about smoking in a hotel common area, you should first make your complaint to the hotel management
ga: Má tá tú ag iarraidh gearán a dhéanamh faoi chaitheamh tobac i limistéar coitianta in óstán, ba cheart duit do ghearán a dhéanamh ar dtús do bhainistíocht an óstáin

source: Remember, it is an offence to smoke in an area that has been designated non-smoking
ga: Meabhraigh: is coir í tobac a chaitheamh i limistéar atá ainmnithe mar áit ina bhfuil "cosc ar thobac"

source: If your complaint about smoking in a common area of a building has not been resolved, you should contact your local Environmental Health Officer – see 'Where to apply' below
ga: Munar tháinig réiteach ar do ghearán maidir le caitheamh tobac i limistéar coitianta d'fhoirgneamh, d'fhéadfá glaoch a chur ar d'Oifigeach Sláinte Áitiúil - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Does my employer have to give me time off work for smoking breaks?
ga: An gcaithfidh m'fhostóir am saor ón obair a thabhairt dom le haghaidh sosanna tobac?

source: Employees are only entitled to time off work for breaks as set down in Section 12 of the Organisation of Working Time Act 1997
ga: Níl fostaithe i dteideal am saor ón obair le haghaidh sosanna ach amháin mar atá leagtha síos in Alt 12 den Acht um Eagrú Ama Oibre 1997

source: Your employer is not obliged to provide smoking breaks for employees
ga: Níl iachall ar do fhostóir sosanna tobac a chur ar fáil d’fhostaithe nuair a chuirfear an cosc ar thobac sa láthair oibre i bhfeidhm

source: Enforcement of the smoking ban
ga: Cur i bhfeidhm an choisc ar thobac

source: Inspections to ensure that the ban is being implemented are undertaken by Environmental Health Officers employed by the Health Service Executive (HSE)
ga: Tá Oifigigh Shláinte Comhshaoil ó Fheidhmeannacht na Seirbhíse Sláinte (FSS) ag déanamh cigireachta chun cinntiú go bhfuil an cosc ar thobac sa láthair oibre á chur i bhfeidhm

source: In addition, inspections are carried out by inspectors from the Health and Safety Authority
ga: Chomh maith leis sin, tá cigirí ón Údarás Sláinte agus Sábháilteachta ag déanamh cigireachta

source: The workplace locations visited by the Health and Safety Authority must comply with the smoke-free measures as part of their general compliance with health and safety requirements
ga: Tá ar na láithreacha oibre a ndéanann an tÚdarás Sláinte agus Sábháilteachta cuairt orthu na riachtanais an choisc ar thobac a chomhlíonadh mar chuid dá gcomhlíonadh ginearálta ar riachtanais shláinte agus sábháilteachta

source: Officers from the HSE work to ensure that smoke-free measures are implemented in workplaces connected with the food and hospitality sector
ga: Déanann oifigigh ón FSS cinnte go bhfuil riachtanais an choisc ar thobac á gcur i bhfeidhm i láithreacha oibre sa rannóg bia agus fáilte

source: Any person found guilty of breaching the ban on smoking in the workplace may be subject to a Class B fine
ga: D’fhéadfaí fíneáil Aicme B a ghearradh ar aon duine a fhaightear ciontach i leith sáraithe an choisc ar thobac sa láthair oibre

source: The owner, manager or person in charge of the workplace is legally responsible for ensuring that the ban on smoking in the workplace is complied with
ga: Is é an t-úinéir, an bainisteoir nó an duine atá i gceannas ar an láthair oibre atá freagrach go dlíthiúil as a chinntiú go gcomhlíontar an cosc ar thobac sa láthair oibre

source: You can read information about tobacco control (pdf), guidelines for employers (pdf) and for the licensed trade (pdf)
ga: Tá faisnéis faoi rialú tobac (pdf), treoir le haghaidh fostóirí (pdf) agus treoir don lucht trádála ceadúnaithe (pdf)

source: Contact your local Environmental Health Officer
ga: Déan teagmháil le d'Oifigeach Sláinte Chomhshaoil áitiúil
